tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1824t39a_tdd.h
#define PSS2BD1                       522
#define PSS2AC0                       523
#define PSS2AC                        524
#define PSS2AC1                       525
#define CCP2AS0                       526
#define CCP2AS                        527
#define CCP2AS1                       528
#define CCP2AS2                       529
#define CCP2ASE                       530
#define PSTR2CON                      531
#define STR2A                         532
#define STR2B                         533
#define STR2C                         534
#define STR2D                         535
#define STR2SYNC                      536
#define CCPTMRS0                      537
#define C1TSEL0                       538
#define C1TSEL                        539
#define C1TSEL1                       540
#define C2TSEL0                       541
#define C2TSEL                        542
#define C2TSEL1                       543
#define C3TSEL0                       544
#define C3TSEL                        545
#define C3TSEL1                       546
#define C4TSEL                        547
#define C4TSEL0                       548
#define C4TSEL1                       549
#define CCPR3L                        550
#define CCPR3H                        551
#define CCP3CON                       552
#define CCP3M                         553
#define CCP3M0                        554
#define CCP3M1                        555
#define CCP3M2                        556
#define CCP3M3                        557
#define DC3B                          558
#define DC3B0                         559
#define DC3B1                         560
#define CCPR4L                        561
#define CCPR4H                        562
#define CCP4CON                       563
#define CCP4M                         564
#define CCP4M0                        565
#define CCP4M1                        566
#define CCP4M2                        567
#define CCP4M3                        568
#define DC4B0                         569
#define DC4B                          570
#define DC4B1                         571
#define INLVLA                        572
#define INLVLA0                       573
#define INLVLA1                       574
#define INLVLA2                       575
#define INLVLA3                       576
#define INLVLA4                       577
#define INLVLA5                       578
#define INLVLC                        579
#define INLVLC0                       580
#define INLVLC1                       581
#define INLVLC2                       582
#define INLVLC3                       583
#define INLVLC4                       584
#define INLVLC5                       585
#define IOCAP                         586
#define IOCAP0                        587
#define IOCAP1                        588
#define IOCAP2                        589
#define IOCAP3                        590
#define IOCAP4                        591
#define IOCAP5                        592
#define IOCAN0                        593
#define IOCAN                         594
#define IOCAN1                        595
#define IOCAN2                        596
#define IOCAN3                        597
#define IOCAN4                        598
#define IOCAN5                        599
#define IOCAF0                        600
#define IOCAF                         601
#define IOCAF1                        602
#define IOCAF2                        603
#define IOCAF3                        604
#define IOCAF4                        605
#define IOCAF5                        606
#define CLKRCON                       607
#define CLKRDIV                       608
#define CLKRDIV0                      609
#define CLKRDIV1                      610
#define CLKRDIV2                      611
#define CLKRDC                        612
#define CLKRDC0                       613
#define CLKRDC1                       614
#define CLKRSLR                       615
#define CLKROE                        616
#define CLKREN                        617
#define MDCON                         618
#define MDBIT                         619
#define MDOUT                         620
#define MDOPOL                        621
#define MDSLR                         622
#define MDOE                          623
#define MDEN                          624
#define MDSRC                         625
#define MDMS0                         626
#define MDMS                          627
#define MDMS1                         628
#define MDMS2                         629
#define MDMS3                         630
#define MDMSODIS                      631
#define MDCARL                        632
#define MDCL0                         633
#define MDCL                          634
#define MDCL1                         635
#define MDCL2                         636
#define MDCL3                         637
#define MDCLSYNC                      638
#define MDCLPOL                       639
#define MDCLODIS                      640
#define MDCARH                        641
#define MDCH                          642
#define MDCH0                         643
#define MDCH1                         644
#define MDCH2                         645
#define MDCH3                         646
#define MDCHSYNC                      647
#define MDCHPOL                       648
#define MDCHODIS                      649
#define TMR4                          650
#define PR4                           651
#define T4CON                         652
#define T4CKPS0                       653
#define T4CKPS                        654
#define T4CKPS1                       655
#define TMR4ON                        656
#define T4OUTPS                       657
#define T4OUTPS0                      658
#define T4OUTPS1                      659
#define T4OUTPS2                      660
#define T4OUTPS3                      661
#define TMR6                          662
#define PR6                           663
#define T6CON                         664
#define T6CKPS0                       665
#define T6CKPS                        666
#define T6CKPS1                       667
#define TMR6ON                        668
#define T6OUTPS0                      669
#define T6OUTPS                       670
#define T6OUTPS1                      671
#define T6OUTPS2                      672
#define T6OUTPS3                      673
#define STATUS_SHAD                   674
#define C_SHAD                        675
#define DC_SHAD                       676
#define Z_SHAD                        677
#define WREG_SHAD                     678
#define BSR_SHAD                      679
#define PCLATH_SHAD                   680
#define FSR0L_SHAD                    681
#define FSR0H_SHAD                    682
#define FSR1L_SHAD                    683
#define FSR1H_SHAD                    684
#define STKPTR                        685
#define TOSL                          686
#define TOSH                          687

#endif // _PIC16LF1824T39A_H_
